Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # local_file.inventory will be created
+ resource "local_file" "inventory" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../playbooks/inventory.yml"
      + id                   = (known after apply)
    }

  # null_resource.cluster will be created
+ resource "null_resource" "cluster" {
      + id = (known after apply)
    }

  # null_resource.wait will be created
+ resource "null_resource" "wait" {
      + id = (known after apply)
    }

  # yandex_compute_disk.nfs-disk will be created
+ resource "yandex_compute_disk" "nfs-disk" {
      + block_size  = 4096
      + created_at  = (known after apply)
      + folder_id   = (known after apply)
      + id          = (known after apply)
      + name        = "nfs-disk"
      + product_ids = (known after apply)
      + size        = 20
      + status      = (known after apply)
      + type        = "network-hdd"
      + zone        = "ru-central1-b"
    }

  # yandex_compute_instance.master01 will be created
+ resource "yandex_compute_instance" "master01" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hostname                  = "master01.netology.yc"
      + id                        = (known after apply)
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCTR2s2Gjdpv2Sq9gBVGnsnZaN0hr8h+N05s03RZOgucyFZ7b2rRlav36Bl8Dg1noje9+o5zIha9bNYwpBmZLGJRsYLI9mmh7NRruapJr/nUYNcbzsZCRvRq85aORorA78KE86sCHgzaA4DNdY3B6TIVInVC1SvImwmhNKZaLu+yqk1v04T6AjfPc5QLb+tors3r2r+5esNj/8Ej9HEGsnXVQmcXRmRRck7FINXxoJdSgOFoKYYnLwCGboXeCtL7sl2G40HLqcclnjVs3lwXZkvkcmWmJcL02aqT4BtL+pDG6D9SUGu3kJIuD3+X+RcMPh+w83bDsefn6dF2s3R1Y06AdAr8JiyHDPsDvsImopCH8udwGCSemSCpo0Xq4LRx0SZx288PaHwFgNUgVZq0g2yIr2D5twAq0m7TWqbvi0qYOIoUbDc3CaDlmcZw9Zrq3rled8UyAjPHwb4sgzOroIavsfvEhkba97qmw/W6RcdjHphwjM/QaWJ8Ye4AK+uRFM= yelena@DESKTOP-T14F2UM
            EOT
        }
      + name                      = "master01"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-b"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd80d16oleqvtagvi2ht"
              + name        = "root-master01"
              + size        = 44
              + snapshot_id = (known after apply)
              + type        = "network-nvme"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = "192.168.20.20"
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 2
          + memory        = 4
        }

      + secondary_disk {
          + auto_delete = true
          + device_name = "nfs"
          + disk_id     = (known after apply)
          + mode        = "READ_WRITE"
        }
    }

  # yandex_compute_instance.worker01 will be created
+ resource "yandex_compute_instance" "worker01" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hostname                  = "worker01.netology.yc"
      + id                        = (known after apply)
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCTR2s2Gjdpv2Sq9gBVGnsnZaN0hr8h+N05s03RZOgucyFZ7b2rRlav36Bl8Dg1noje9+o5zIha9bNYwpBmZLGJRsYLI9mmh7NRruapJr/nUYNcbzsZCRvRq85aORorA78KE86sCHgzaA4DNdY3B6TIVInVC1SvImwmhNKZaLu+yqk1v04T6AjfPc5QLb+tors3r2r+5esNj/8Ej9HEGsnXVQmcXRmRRck7FINXxoJdSgOFoKYYnLwCGboXeCtL7sl2G40HLqcclnjVs3lwXZkvkcmWmJcL02aqT4BtL+pDG6D9SUGu3kJIuD3+X+RcMPh+w83bDsefn6dF2s3R1Y06AdAr8JiyHDPsDvsImopCH8udwGCSemSCpo0Xq4LRx0SZx288PaHwFgNUgVZq0g2yIr2D5twAq0m7TWqbvi0qYOIoUbDc3CaDlmcZw9Zrq3rled8UyAjPHwb4sgzOroIavsfvEhkba97qmw/W6RcdjHphwjM/QaWJ8Ye4AK+uRFM= yelena@DESKTOP-T14F2UM
            EOT
        }
      + name                      = "worker01"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-b"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd80d16oleqvtagvi2ht"
              + name        = "root-worker01"
              + size        = 50
              + snapshot_id = (known after apply)
              + type        = "network-nvme"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = "192.168.20.21"
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 8
        }
    }

  # yandex_compute_instance.worker02 will be created
+ resource "yandex_compute_instance" "worker02" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hostname                  = "worker02.netology.yc"
      + id                        = (known after apply)
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCTR2s2Gjdpv2Sq9gBVGnsnZaN0hr8h+N05s03RZOgucyFZ7b2rRlav36Bl8Dg1noje9+o5zIha9bNYwpBmZLGJRsYLI9mmh7NRruapJr/nUYNcbzsZCRvRq85aORorA78KE86sCHgzaA4DNdY3B6TIVInVC1SvImwmhNKZaLu+yqk1v04T6AjfPc5QLb+tors3r2r+5esNj/8Ej9HEGsnXVQmcXRmRRck7FINXxoJdSgOFoKYYnLwCGboXeCtL7sl2G40HLqcclnjVs3lwXZkvkcmWmJcL02aqT4BtL+pDG6D9SUGu3kJIuD3+X+RcMPh+w83bDsefn6dF2s3R1Y06AdAr8JiyHDPsDvsImopCH8udwGCSemSCpo0Xq4LRx0SZx288PaHwFgNUgVZq0g2yIr2D5twAq0m7TWqbvi0qYOIoUbDc3CaDlmcZw9Zrq3rled8UyAjPHwb4sgzOroIavsfvEhkba97qmw/W6RcdjHphwjM/QaWJ8Ye4AK+uRFM= yelena@DESKTOP-T14F2UM
            EOT
        }
      + name                      = "worker02"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-b"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd80d16oleqvtagvi2ht"
              + name        = "root-worker02"
              + size        = 50
              + snapshot_id = (known after apply)
              + type        = "network-nvme"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = "192.168.20.22"
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + resources {
          + core_fraction = 100
          + cores         = 4
          + memory        = 8
        }
    }

  # yandex_vpc_network.default will be created
+ resource "yandex_vpc_network" "default" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = (known after apply)
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "netology-net"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_subnet.netology-subnet-a will be created
+ resource "yandex_vpc_subnet" "netology-subnet-a" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "netology-subnet-a"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.10.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # yandex_vpc_subnet.netology-subnet-b will be created
+ resource "yandex_vpc_subnet" "netology-subnet-b" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "netology-subnet-b"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.20.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ external_ip_address_node00 = (known after apply)
+ external_ip_address_node01 = (known after apply)
+ external_ip_address_node02 = (known after apply)
+ internal_ip_address_node00 = "192.168.20.20"
+ internal_ip_address_node01 = "192.168.20.21"
+ internal_ip_address_node02 = "192.168.20.22"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](http://214a02e42bed:4141/lock?id=Scandr%252Fnetology_devops_diploma%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>
Plan: 10 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`